"use strict";
// This icon file is generated automatically.
Object.defineProperty(exports, "__esModule", { value: true });
// 生成抽象节点
var CallEndTwoTone = { "icon": { "tag": "svg", "attrs": { "viewBox": "64 64 896 896", "focusable": "false" }, "children": [{ "tag": "path", "attrs": { "d": "M0 0h24v24H0V0z" } }, { "tag": "path", "attrs": { "d": "M18.59 12.23c.67.38 1.3.8 1.88 1.27l1.07-1.07a15.73 15.73 0 00-2.96-1.91v1.71zM3.53 13.49c.59-.48 1.22-.9 1.87-1.27v-1.7a15.06 15.06 0 00-2.94 1.9l1.07 1.07z", "opacity": ".3" } }, { "tag": "path", "attrs": { "d": "M12 7C7.46 7 3.34 8.78.29 11.67a1 1 0 00-.29.71c0 .28.11.53.29.7l2.48 2.48a1 1 0 00.71.29c.27 0 .52-.1.7-.28.79-.73 1.68-1.36 2.66-1.85a1 1 0 00.56-.9v-3.1a14.91 14.91 0 019.19.01v3.1c0 .4.23.74.56.9.98.49 1.88 1.11 2.67 1.85.18.17.43.28.7.28a1 1 0 00.71-.29l2.48-2.48a1 1 0 00.29-.71 1 1 0 00-.29-.71A16.97 16.97 0 0012 7zm-6.6 5.22c-.65.37-1.28.79-1.87 1.27l-1.07-1.07c.91-.75 1.9-1.38 2.94-1.9v1.7zm15.07 1.28c-.58-.47-1.21-.89-1.88-1.27v-1.71a14.8 14.8 0 012.96 1.91l-1.08 1.07z" } }] }, "name": "call_end", "theme": "twotone" };
exports.default = CallEndTwoTone;
