"use strict";
// This icon file is generated automatically.
Object.defineProperty(exports, "__esModule", { value: true });
// 生成抽象节点
var RotateRightRound = { "icon": { "tag": "svg", "attrs": { "viewBox": "64 64 896 896", "focusable": "false" }, "children": [{ "tag": "path", "attrs": { "d": "M0 0h24v24H0V0z" } }, { "tag": "path", "attrs": { "d": "M14.83 4.83L12.7 2.7a1 1 0 00-1.7.71v.66a8 8 0 00-1.23 15.61c.62.18 1.23-.32 1.23-.96v-.03a.97.97 0 00-.68-.94A5.98 5.98 0 0111 6.09v1.53a1 1 0 001.7.71l2.13-2.08a.99.99 0 000-1.42zm4.84 4.93a7.85 7.85 0 00-.66-1.59c-.31-.57-1.1-.66-1.56-.2l-.01.01a.97.97 0 00-.17 1.16c.2.37.36.76.48 1.16.12.42.51.7.94.7h.02c.65 0 1.15-.62.96-1.24zM13 18.68v.02a.99.99 0 001.24.96 7.85 7.85 0 001.59-.66c.57-.31.66-1.1.2-1.56l-.02-.02a.97.97 0 00-1.16-.17 5.6 5.6 0 01-1.16.49.98.98 0 00-.69.94zm4.44-2.65c.46.46 1.25.37 1.56-.2.28-.51.5-1.04.67-1.59a.99.99 0 00-.96-1.24h-.02a.97.97 0 00-.94.7c-.12.4-.28.79-.48 1.17a.98.98 0 00.17 1.16z" } }] }, "name": "rotate_right", "theme": "round" };
exports.default = RotateRightRound;
