// This icon file is generated automatically.

import { IconDefinition } from '../types';

// 生成抽象节点
const HdrOnSelectRound: IconDefinition = {"icon":{"tag":"svg","attrs":{"viewBox":"64 64 896 896","focusable":"false"},"children":[{"tag":"path","attrs":{"d":"M0 0h24v24H0V0z"}},{"tag":"path","attrs":{"d":"M18 18.5v-1c0-.83-.67-1.5-1.5-1.5H14a1 1 0 00-1 1v4.31c0 .38.31.69.69.69h.11a.7.7 0 00.69-.69V20h1.1l.72 1.59c.11.25.36.41.63.41a.7.7 0 00.64-.97l-.48-1.13c.5-.3.9-.8.9-1.4zm-1.5 0h-2v-1h2v1zm-13-.5h-2v-1.25A.76.76 0 00.75 16a.76.76 0 00-.75.75v4.5c0 .41.34.75.75.75s.75-.34.75-.75V19.5h2v1.75c0 .41.34.75.75.75s.75-.34.75-.75v-4.5a.76.76 0 00-.75-.75.76.76 0 00-.75.75V18zm6.5-2H7.5a1 1 0 00-1 1v4a1 1 0 001 1H10c.82 0 1.5-.67 1.5-1.5v-3c0-.83-.68-1.5-1.5-1.5zm0 4.5H8v-3h2v3zm13.25-.5H22v1.25c0 .41-.34.75-.75.75a.76.76 0 01-.75-.75V20h-1.25a.76.76 0 01-.75-.75c0-.41.34-.75.75-.75h1.25v-1.25c0-.41.34-.75.75-.75s.75.34.75.75v1.25h1.25c.41 0 .75.34.75.75s-.34.75-.75.75zM12 4a4 4 0 110 8 4 4 0 010-8m0-2a6 6 0 10.01 12.01A6 6 0 0012 2z"}}]},"name":"hdr_on_select","theme":"round"};

export default HdrOnSelectRound;
