// This icon file is generated automatically.

import { IconDefinition } from '../types';

// 生成抽象节点
const ManageAccountsRound: IconDefinition = {"icon":{"tag":"svg","attrs":{"viewBox":"64 64 896 896","focusable":"false"},"children":[{"tag":"path","attrs":{"d":"M0 0h24v24H0V0z"}},{"tag":"path","attrs":{"d":"M10.67 13.02L10 13c-2.42 0-4.68.67-6.61 1.82A2.92 2.92 0 002 17.35V19a1 1 0 001 1h8.26a6.96 6.96 0 01-.59-6.98z"}},{"tag":"circle","attrs":{"cx":"10","cy":"8","r":"4"}},{"tag":"path","attrs":{"d":"M20.75 16c0-.22-.03-.42-.06-.63l.84-.73a.5.5 0 00.1-.63l-.59-1.02a.49.49 0 00-.59-.22l-1.06.36a3.65 3.65 0 00-1.08-.63l-.22-1.09a.5.5 0 00-.49-.4h-1.18a.5.5 0 00-.49.4l-.22 1.09c-.4.15-.76.36-1.08.63l-1.06-.36a.5.5 0 00-.59.22l-.59 1.02a.5.5 0 00.1.63l.84.73c-.03.21-.06.41-.06.63s.03.42.06.63l-.84.73a.5.5 0 00-.1.63l.59 1.02c.12.21.37.3.59.22l1.06-.36c.32.27.68.48 1.08.63l.22 1.09c.05.23.25.4.49.4h1.18a.5.5 0 00.49-.4l.22-1.09c.4-.15.76-.36 1.08-.63l1.06.36a.5.5 0 00.59-.22l.59-1.02a.5.5 0 00-.1-.63l-.84-.73c.03-.21.06-.41.06-.63zM17 18c-1.1 0-2-.9-2-2s.9-2 2-2 2 .9 2 2-.9 2-2 2z"}}]},"name":"manage_accounts","theme":"round"};

export default ManageAccountsRound;
