// This icon file is generated automatically.

import { IconDefinition } from '../types';

// 生成抽象节点
const SickTwoTone: IconDefinition = {"icon":{"tag":"svg","attrs":{"viewBox":"64 64 896 896","focusable":"false"},"children":[{"tag":"path","attrs":{"d":"M0 0h24v24H0z"}},{"tag":"path","attrs":{"d":"M7.32 10.56L8.38 9.5 7.32 8.44l1.06-1.06L10.5 9.5l-2.12 2.12-1.06-1.06zM4.5 9l.08.01A8 8 0 0117.61 6.3c.15-.6.45-1.29.81-1.96a10 10 0 00-16.24 5.8A3 3 0 014.5 9zM21 10.5c-.42 0-.82-.09-1.19-.22a8 8 0 01-15.23 4.71L4.5 15a3.06 3.06 0 01-2.32-1.1 10 10 0 0019.68-3.52 3.5 3.5 0 01-.86.12zM21 3s-2 2.9-2 4 .9 2 2 2 2-.9 2-2-2-4-2-4zm-5.38 4.38L13.5 9.5l2.12 2.12 1.06-1.06-1.06-1.06 1.06-1.06-1.06-1.06zM8.56 17c.69-1.19 1.97-2 3.44-2s2.75.81 3.44 2h1.68a5.5 5.5 0 00-7.55-2.93L5.99 12c0-.52-.26-1.02-.74-1.29a1.5 1.5 0 00-1.5 2.6 1.5 1.5 0 001.49 0l2.97 1.72A5.4 5.4 0 006.88 17h1.68z"}}]},"name":"sick","theme":"twotone"};

export default SickTwoTone;
