// This icon file is generated automatically.

import { IconDefinition } from '../types';

// 生成抽象节点
const WifiCalling3Round: IconDefinition = {"icon":{"tag":"svg","attrs":{"viewBox":"64 64 896 896","focusable":"false"},"children":[{"tag":"path","attrs":{"d":"M0 0h24v24H0V0z"}},{"tag":"path","attrs":{"d":"M21.54 4.8A7.9 7.9 0 0016.49 3c-1.92 0-3.67.67-5.05 1.8a.74.74 0 00-.05 1.1l.01.01c.27.27.7.29 1 .05a6.45 6.45 0 018.18 0c.3.24.73.23 1-.05l.01-.01a.74.74 0 00-.05-1.1z"}},{"tag":"path","attrs":{"d":"M19.45 8.04a.75.75 0 00-.11-1.15 4.97 4.97 0 00-5.7 0 .76.76 0 00-.11 1.15c.25.25.65.31.94.1a3.52 3.52 0 014.04 0c.29.21.69.15.94-.1zM16.49 8.9c-.32 0-.62.08-.89.21-.3.15-.34.56-.11.79l.65.65c.2.2.51.2.71 0l.65-.65c.23-.23.19-.64-.11-.79a1.95 1.95 0 00-.9-.21z"}},{"tag":"path","attrs":{"d":"M15.63 14.4l-2.52 2.5a16.14 16.14 0 01-6-6l2.5-2.52c.23-.24.33-.57.27-.9L9.13 3.8a1 1 0 00-.98-.8H4a1 1 0 00-1 1.03A18.07 18.07 0 0019.97 21 1 1 0 0021 20v-4.15a1 1 0 00-.8-.98l-3.67-.73a.98.98 0 00-.9.26z"}}]},"name":"wifi_calling_3","theme":"round"};

export default WifiCalling3Round;
